{"head":{"cizm_thread_id":"By539KC6g","cizm_path":"https://www.collaborizm.com/thread/By539KC6g","category":"tutorial","date":"2017-04-14T17:45:21.924Z","description":"The Boston Tea Party and Gandhi's Salt March (1, 2) have taught us not to pay overpriced and sometimes unjustified taxes and duties. This…","title":"Buying from China without paying Customs Duty/Tax.","stripped_title":"buying-from-china-without-paying-customs-dutytax","route":"blog/buying-from-china-without-paying-customs-dutytax.md","layout":"Post"},"body":"<p>The <strong><a target=_blank href=\"https://en.wikipedia.org/wiki/Boston_Tea_Party\">Boston Tea Party</a></strong> and Gandhi’s <strong>Salt March</strong> (<a target=_blank href=\"http://www.history.com/news/gandhis-salt-march-85-years-ago\">1</a>, <a target=_blank href=\"http://www.dandimemorial.in/\">2</a>) have taught us not to pay overpriced and sometimes unjustified taxes and duties. This is a small guide for buying stuff from the <strong>People’s Republic of China (PRC)</strong>, not the <strong>Republic of China (Taiwan)</strong>.</p>\n<p>Don’t buy locally from importers who don’t provide legal invoices. They are actually buying stuff in small quantities from the above-mentioned sites without paying duties, yet charge you exorbitant profit margins. They’re cheating you as well as your country’s government. Also, they will not cover warranties.</p>\n<p> </p>\n<h2>Context</h2>\n<ul>\n<li>This guide is valid across the <strong>Indian subcontinent (South Asia), i.e., India, Pakistan, Bangladesh, Nepal, and Bhutan</strong>.</li>\n<li>Not valid for countries like <strong>Brazil, Russia, etc.</strong> where the <strong>Customs</strong> departments are more efficient.</li>\n<li>Please comment with your experiences with your country’s <strong>Customs</strong> and correct me if I’m wrong.</li>\n</ul>\n<p> </p>\n<h2>Before buying</h2>\n<ul>\n<li>Use only reputed e-commerce sites like <strong>AliExpress, Banggood, DealExtreme, etc</strong></li>\n<li>Use mobile apps for more discounts.</li>\n<li>Search for stuff and order by numbers sold.<br>\nBuy from sellers who have sold highest number of orders, taking cost into account.</li>\n<li>Chinese sellers are not very technically inclined, so don’t expect them to answer all your technical doubts/queries.</li>\n</ul>\n<p> </p>\n<h2>While buying</h2>\n<ul>\n<li>If possible, use only <strong>(China) Govt. post registered air mail/parcel</strong>.<br>\nThis might take 30-45 days for delivery, but it’s less likely to be held and charged by <strong>Customs</strong> than premium shippers like DHL or FedEx that typically deliver within a week.</li>\n<li>Tell the seller to declare stuff as <strong>sample</strong> or <strong>replacement</strong> part in the invoice, and declare only 10% of the price. See that amount declared is proportional to the size/volume of the shipment.</li>\n<li>Break down large quantities into smaller packages.</li>\n<li>Order only to residential addresses.</li>\n<li>Order not only to your house but also to your neighbours’ as well as your friends’ houses.</li>\n<li>As a rule of thumb, don’t buy stuff that costs above $80-100. If it’s flagged by <strong>Customs</strong>, you’ll end up paying more than 1.5x of the price of the locally available alternative.</li>\n</ul>\n<p> </p>\n<h2>After buying</h2>\n<ul>\n<li>Do not confirm delivery. Allow protection period to run out.</li>\n<li>Check the stuff for defects as soon as they arrive.</li>\n<li>Before filing disputes, contact the seller once to see if they are reasonable. Most of them will tell you to file disputes. If they don’t, file disputes anyways.</li>\n<li>Be polite to sellers. They like to be addressed as <em>friend</em> or <em>brother/sister</em>. Keep wishing them on Chinese festivals. If they like you, they’ll give you coupons and will also tell you about upcoming offers or new products.</li>\n</ul>\n<p> </p>\n<h2>Buy locally</h2>\n<ul>\n<li>When you don’t want to wait a month or more.</li>\n<li>You have money to spend.</li>\n<li>If you don’t mind buying from legal importers after shelling more money.</li>\n<li>If you don’t think that corrupt politicians are milking your country more than you are.</li>\n<li>If you are worried about your country’s trade deficit with China.</li>\n<li>Want to make your country great again. 😛</li>\n</ul>\n","__filename":"blog/collaborizm_posts/buying-from-china-without-paying__14-04-2017.md","__url":"/blog/buying-from-china-without-paying-customs-dutytax/","__resourceUrl":"/blog/buying-from-china-without-paying-customs-dutytax/index.html","__dataUrl":"/blog/buying-from-china-without-paying-customs-dutytax/index.html.cd2705352581092fa92ef1d3861626b0.json"}